Repository: VCheckOrg/vycheck_ios
Catalog: VCheckSDK/VCheckSDK/*.lproj/Localizable.strings
Languages: pl, ru, uk

# enter_valid_dob
source: Enter DOB in format 'YYYY-MM-DD'
pl: Wprowadź datę urodzenia w formacie 'RRRR-MM-DD'
ru: Введите дату рождения в формате 'ГГГГ-ММ-ДД'
uk: Введіть дату народження у форматі 'РРРР-ММ-ДД'

# enter_valid_doc_number
source: Enter valid document number
pl: Proszę wpisać poprawny numer dokumentu
ru: Введите валидный номер документа
uk: Введіть валідний номер документа

source: Enter valid name
pl: Proszę wpisać prawidłowe imię
ru: Введите валидное имя
uk: Введіть валідне ім'я

source: Enter valid surname
pl: Proszę wpisz właściwe nazwisko
ru: Введите валидную фамилию
uk: Введіть валідне прізвище

# error_make_at_least_one_photo
source: Please make at least one photo of the document
pl: Zrób co najmniej jedno zdjęcie dokumentu
ru: Пожалуйста, сделайте как минимум одно фото документа
uk: Будь ласка, зробіть щонайменше одну фотографію документа

# error_make_one_photo
source: Please make one photo of the document
pl: Proszę zrobić jedno zdjęcie dokumentu
ru: Пожалуйста, сделайте одно фото документа
uk: Будь ласка, зробіть одну фотографію документа

# error_make_two_photos
source: Please make all required photos of the document
pl: Proszę zrobić wszystkie niezbędne dokumenty fotograficzne
ru: Пожалуйста, сделайте все необходимые фото документа
uk: Будь ласка, зробіть усі необхідні фото документа

# error_some_fields_are_empty
source: Please fill all empty document fields
pl: Proszę wypełnić wszystkie pola dokumentu
ru: Пожалуйста, заполните все поля документа
uk: Будь ласка, заповніть всі поля документа

# line_face_obstacle
source: Hold phone at eye level
pl: Trzymaj telefon na wysokości wzroku
ru: Держите телефон на уровне глаз
uk: Тримайте телефон на рівні очей

# liveness_stage_check_face_pos
source: Hold phone at eye level
pl: Trzymaj telefon na wysokości wzroku
ru: Держите телефон на уровне глаз
uk: Тримайте телефон на рівні очей

# liveness_stage_face_left
source: Turn your head to the left
pl: Odwróć głowę w lewo
ru: Поверните голову влево
uk: Поверніть голову ліворуч

# liveness_stage_face_right
source: Turn your head to the right
pl: Odwróć głowę w prawo
ru: Поверните голову вправо
uk: Поверніть голову праворуч

# liveness_stage_face_up
source: Lift your head up
pl: Podnieś głowę do góry
ru: Поднимите голову вверх
uk: Підніміть голову вгору

# liveness_stage_face_down
source: Put your head down
pl: Opuść głowę
ru: Наклоните голову вниз
uk: Опустіть голову вниз

# liveness_stage_open_mouth
source: Open your mouth
pl: Otwórz usta
ru: Откройте рот
uk: Відкрийте рота

# liveness_stage_blink_eyes
source: Blink your eyes
pl: Mrugnij oczami
ru: Моргните глазами
uk: Моргніть очима

# photo_loaing_wait_discl
source: Please, wait. The photo of your document is being loaded and processed. This may take from a few seconds to a minute.
pl: Proszę czekać. Zdjęcie Twojego dokumentu jest przesyłane i przetwarzane. Może to trwać od kilku sekund do minuty.
ru: Пожалуйста, подождите. Идет загрузка и обработка фото вашего документа. Это может занять от нескольких секунд до минуты.
uk: Будь ласка, зачекайте. Йде завантаження та обробка фото вашого документа. Це може тривати від кількох секунд до хвилини.

# photo_upload_title_common_back
source: Photo of the last page / side with your photo (if you have multiple photos in the document)
pl: Zdjęcie ostatniej strony z Twoim zdjęciem (jeśli masz wiele zdjęć w dokumencie)
ru: Фотография последней страницы/стороны с вашей фотографией (если у вас несколько фотографий в документе)
uk: Фотографія останньої сторінки/сторони з вашою фотографією (якщо у вас є кілька фотографій у документі)

# photo_upload_title_common_forward
source: Photo of the first page / side of the document (with your photo)
pl: Zdjęcie pierwszej strony dokumentu (z Twoim zdjęciem)
ru: Фотография первой страницы/стороны документа (с вашим фото)
uk: Фотографія першої сторінки/сторони документа (з вашим фото)

# photo_upload_title_foreign
source: Full spread of the document with your photo
pl: Pełne rozłożenie dokumentu z Twoim zdjęciem
ru: Полный разворот документа с вашим фото
uk: Повний розворот документа з вашим фото

# photo_upload_title_id_card_back
source: Back side of the ID card
pl: Tylna strona dowodu osobistego
ru: Задняя сторона ID-карты
uk: Задня сторона ID-картки

# photo_upload_title_id_card_forward
source: Front side of the ID card
pl: Przednia strona dowodu osobistego
ru: Передняя сторона ID-карты
uk: Передня сторона ID-картки

# no_search_data_label
source: No data available
pl: Brak dostępnych danych
ru: Нет данных
uk: Немає даних

# confident_in_doc_title
source: I am confident in my document, continue the verification process
pl: Jestem pewny swojego dokumentu, kontynuuj proces weryfikacji
ru: Я уверен(-а) в своем документе, продолжить процесс верификации
uk: Я впевнений(-а) в своєму документі, продовжити процес верифікації

# doc_date_placeholder
source: YYYY-MM-DD
pl: RRRR-MM-DD
ru: ГГГГ-ММ-ДД
uk: РРРР-ММ-ДД

source: Non available
pl: Niedostępne
ru: Недоступно
uk: Недоступно

source: Bermuda
pl: Bermudy
ru: Бермудские Острова
uk: Бермудські Острови

# invalid_doc_type_desc
source: Document compliance check failed. Please, download the correct document
pl: Sprawdzenie zgodności dokumentów nie powiodło się. Proszę pobrać poprawny dokument
ru: Не пройдена проверка соответствия данных документа. Пожалуйста, загрузите корректный документ
uk: Не пройдено перевірку відповідності даних документа. Завантажте, будь ласка, коректний документ

# verif_error_desc
source: Document verification is not successful
pl: Weryfikacja dokumentu nie powiodła się
ru: Верификация документа неуспешна
uk: Верифікація документа неуспішна

# check_doc_fields_input_message
source: Some document fields are not properly filled or empty
pl: Sprawdź, czy wszystkie pola dokumentu są poprawnie wypełnione
ru: Проверте правильность заполнения всех полей документа
uk: Перевірте правильність заповнення усіх полей документа

# need_camera_access_title
source: Need Camera Access
pl: Dostęp do aparatu
ru: Доступ к Камере
uk: Доступ до камери

# need_camera_access_descr
source: Camera access is required for taking document photos and performing face-checking sessions.
pl: Należy zapewnić dostęp do aparatu w celu sfotografowania dokumentów i przeprowadzenia sesji weryfikacji twarzy.
ru: Необходимо предоставить доступ к камере для фотографирования документов и проведения сеансов проверки лица.
uk: Необхідно надати доступ до камери для фотографування документів і проведення сеансів перевірки обличчя.

source: Allow
pl: Udostępnić
ru: Позволить
uk: Надати

source: Decline
pl: Odrzucić
ru: Запретить
uk: Відхилити

# declined_camera_access
source: Camera access is declined: that will make the major product features unavailable. To allow Camera acess, re-launch app or go to Settings.
pl: Odmowa dostępu do aparatu: spowoduje to, że główne funkcje produktu będą niedostępne. Aby zezwolić na dostęp do kamery, uruchom ponownie aplikację lub przejdź do Ustawień.
ru: Доступ к камере отклонен: это сделает недоступными основные функции продукта. Чтобы разрешить доступ к камере, перезапустите приложение или перейдите в Системные Настройки.
uk: Доступ до камери відхилено: через це основні функції продукту стануть недоступними. Щоб дозволити доступ до камери, перезапустіть додаток або перейдіть у Налаштування.

source: Proceed
pl: Kontynuować
ru: Продолжить
uk: Продовжити

# seg_make_photo
source: Take a photo
pl: Robić zdjęcie
ru: Сделать фото
uk: Зробити фото

source: Retry
pl: Spróbować ponownie
ru: Попробовать снова
uk: Спробувати ще

# segmentation_instr_inner_passport_title
source: Take a photo of your passport
pl: Zrób zdjęcie paszportu obywatela
ru: Сделайте фото паспорта
uk: Зробіть фото паспорта

# segmentation_instr_foreign_passport_title
source: Take a photo of your foreign passport
pl: Zrób zdjęcie paszportu
ru: Сделайте фото загранпаспорта
uk: Зробіть фото закордонного паспорта

# segmentation_instr_id_card_title
source: Take a photo of your ID card
pl: Zrób zdjęcie dowodu osobistego
ru: Сделайте фото ID-карты
uk: Зробіть фото ID-картки

# segmentation_instr_inner_passport_descr
source: Follow the on-screen instructions to take a full-page photo of your passport (both pages visible)
pl: Postępując zgodnie z instrukcjami na ekranie, zrób zdjęcie całej rozkładówki paszportu (obie strony są widoczne)
ru: Следуя инструкциям на экране, сделайте фото полного разворота паспорта (видны обе страницы)
uk: Дотримуючись інструкцій на екрані, зробіть фото повного розвороту паспорта (видно обидві сторінки)

# segmentation_instr_foreign_passport_descr
source: Following the instructions on the screen, take a photo of a full-page spread of your passport (both pages are visible)
pl: Postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby zrobić zdjęcie całostronicowej rozkładówki paszportu (widoczne obie strony)
ru: Следуя инструкциям на экране, сделайте фото полного разворота загранпаспорта (видны обе страницы)
uk: Дотримуючись інструкцій на екрані, зробіть фото повного розвороту закордонного паспорта (видно обидві сторінки)

# segmentation_instr_id_card_descr
source: Follow the on-screen instructions to take a photo of the front and then the back of your ID card
pl: Postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby zrobić zdjęcie przedniej i tylnej strony dowodu osobistego
ru: Следуя инструкциям на экране, сделайте фото лицевой, а затем обратной сторон вашей ID-карты
uk: Дотримуючись інструкцій на екрані, зробіть фото лицьової, а потім зворотньої сторони вашої ID-картки

# segmentation_general_instruction
source: Prepare your document and place it in the specified zone as in the example above.
pl: Przygotuj dokument i umieść go we wskazanym obszarze, jak w powyższym przykładzie.
ru: Приготовьте свой документ и разместите его в указанной зоне, как на примере выше.
uk: Приготуйте свій документ і розмістіть його у зазначеній зоні, як на прикладі вище.

source: I'm ready
pl: Jestem gotowy
ru: Я готов(а)
uk: Я готовий(а)

# segmentation_single_page_hint
source: Put the document in the specified zone for automatic reading
pl: Umieść dokument w określonej strefie do automatycznego odczytu
ru: Поместите документ в указанную зону для автоматического считывания
uk: Помістіть документ у вказану зону для автоматичного зчитування

# segmentation_front_side_hint
source: Place the front side of the document in the specified zone for automatic reading
pl: Umieść przednią stronę dokumentu w wyznaczonym miejscu do automatycznego odczytu
ru: Поместите переднюю сторону документа в указанную зону для автоматического считывания
uk: Помістіть передню сторону документа у вказану зону для автоматичного зчитування

# segmentation_back_side_hint
source: Place the back side of the document in the specified zone for automatic reading
pl: Umieść tylną stronę dokumentu w wyznaczonym miejscu do automatycznego odczytu
ru: Поместите обратную сторону документа в указанную зону для автоматического считывания
uk: Помістіть зворотню сторону документа у вказану зону для автоматичного зчитування

# segmentation_stage_success
source: Document scanned successfully!
pl: Dokument został zeskanowany pomyślnie!
ru: Документ считан успешно!
uk: Документ зчитаний успішно!

# segmentation_stage_success_first_page
source: Front side scanned successfully. Please turn over the document/page.
pl: Przednia strona została pomyślnie odczytana. Proszę odwrócić dokument/stronę.
ru: Передняя сторона успешно считана. Пожалуйста, переверните документ/страницу.
uk: Передня сторона успішно зчитана. Будь ласка, переверніть документ/сторінку.

# no_time_seg_title
source: The time to take document photo(s) has expired
pl: Czas przeznaczony na zeskanowanie dokumentu upłynął
ru: Время на считывание документа истекло
uk: Час на сканування документу вийшов

# no_time_seg_descr
source: We could not find the document in the given zone. Make sure you have selected the correct document type and that it's clearly visible in the camera.
pl: Nie mogliśmy znaleźć dokumentu w danej strefie. Upewnij się, że wybrałeś właściwy typ dokumentu i że jest on wyraźnie widoczny w aparacie.
ru: Мы не смогли обнаружить документ в заданной зоне. Убедитесь, что вы выбрали правильный тип документа и он хорошо виден в камеру.
uk: Ми не змогли знайти документ у заданій зоні. Переконайтеся, що ви вибрали правильний тип документа і його добре видно в камеру.

source: Make photo by hand
pl: Zrób zdjęcie ręcznie
ru: Сделать фото вручную
uk: Зробити фото вручну

# pop_sdk_title
source: To verification start
pl: Do początku weryfikacji
ru: К началу верификации
uk: До старту верифікації

source: Cancel
pl: Anulować
ru: Отмена
uk: Відмінити

# fatal_error_seg_descr
source: We were unable to do a full scan of the document. To continue, you need to take a photo manually.
pl: Nie byliśmy w stanie wykonać pełnego skanu dokumentu. Aby kontynuować, musisz zrobić zdjęcie ręcznie.
ru: Мы не смогли сделать полное сканирование документа. Для продолжения требуется сделать фото вручную.
uk: Ми не змогли зробити повне сканування документа. Для продовження потрібно зробити фото вручну.

source: Contact support
pl: Skontaktuj się z działem pomocy technicznej
ru: Обратиться в службу поддержки
uk: Звернутися в службу підтримки

source: Confirm
pl: Potwierdzić
ru: Подтвердить
uk: Підтвердити

# got_it
source: Excellent!
pl: Doskonale
ru: Отлично
uk: Чудово

# verification_in_process_title
source: Your application is already processing
pl: Twoja aplikacja już jest na etapie przetwarzania
ru: Ваша заявка уже находится в обработке
uk: Ваша заявка вже знаходиться в обробці

# verification_in_process_subtitle
source: This may take some time.
pl: To może zająć troche czasu.
ru: Это может занять некоторое время.
uk: Це може зайняти деякий час.

# good_camera_text
source: filmed with a good camera
pl: nakręcony dobrym aparatem
ru: снято на хорошую камеру
uk: знятий на хорошу камеру

# good_doc_light_text
source: well lit
pl: dobrze oświetlony
ru: хорошо освещенный
uk: добре освітлений

# enter_valid_exp_date
source: Enter a valid expiration date of your document
pl: Proszę wpisać prawidłowy termin ważności dokumentu
ru: Введите валидный срок действия документа
uk: Введіть валідний термін дії документу

# choose_provider_title
source: Choose a verification method
pl: Wybierz metodę weryfikacji
ru: Выберите метод верификации
uk: Оберіть метод верифікації

# choose_provider_description
source: To proceed with verification, choose the provider from the list of available for your country.
pl: Aby kontynuować weryfikację, wybierz dostawcę z listy dostępnej dla Twojego kraju.
ru: Для продолжения верификации выберите провайдера из списка доступных для вашей страны.
uk: Для продовження верифікації оберіть провайдера зі списку доступних для вашої країни.

# vcheck_provider_description
source: Verification with document upload
pl: Weryfikacja z wgrywaniem dokumentów
ru: Верификация с подгрузкой документов
uk: Верифікація із підвантаженням документів

# verification_expired
source: Verification session expired. Please, try again.
pl: Sesja weryfikacyjna wygasła. Proszę spróbuj ponownie.
ru: Сеанс верификации истек. Пожалуйста, попробуйте еще раз.
uk: Сеанс верифікації закінчився. Будь ласка, спробуйте ще раз.

# doc_verif_camera_timeout_title
source: We weren't able to locate your document
pl: Nie zmogliśmy znaleźć dokumentu w określonym obszarze
ru: Мы не смогли обнаружить документ в заданной зоне
uk: Ми не змогли знайти документ у заданій зоні

# doc_verif_camera_timeout_text
source: We could not find your document in time. Make sure you have selected the correct document type and that it is clearly visible on the camera.
pl: Czas na przetworzenie dokumentu upłynął. Upewnij się, że wybrałeś właściwy rodzaj dokumentu i że jest on wyraźnie widoczny dla kamery
ru: Время на считывание документа истекло. Убедитесь, что вы выбрали правильный тип документа и он хорошо виден в камеру
uk: Час на зчитування документа минув. Переконайтеся, що ви обрали правильний тип документа і його добре видно в камеру

# doc_verif_not_scanned_title
source: Could not scan document
pl: Nie można zeskanować dokumentu
ru: Не получается отсканировать документ
uk: Неможливо відсканувати документ

# doc_verif_not_scanned_text
source: If you have problems scanning a document, we advise you to pass verification on another device with a good camera. You can also try to take a manual photo of your document (without auto-detection of the framed document)
pl: Jeśli masz problemy ze skanowaniem dokumentu, radzimy przejść weryfikację na innym urządzeniu z dobrym aparatem. Możesz także spróbować zrobić zwykłe zdjęcie swojego dokumentu (bez automatycznego wykrywania dokumentu w ramce)
ru: Если у вас возникли проблемы при сканировании документа, советуем пройти верификацию на другом устройстве с хорошей камерой. Также вы можете попробовать сделать обычное фото своего документа (без автоопределения документа в рамке)
uk: Якщо у вас виникли проблеми при скануванні документу, радимо пройти верифікацію на іншому пристрої з камерою хорошої якості. Також ви можете спробувати зробити звичайне фото свого документа (без автовизначення документа в рамці)

# doc_verif_invalid_document_type_title
source: Document verification is not successful
pl: Weryfikacja dokumentu nie powiodła się
ru: Верификация документа неуспешна
uk: Верифікація документа неуспішна

# doc_verif_invalid_document_type_text
source: The document does not match the selected type. We recommend to re-upload the document.
pl: Dokument nie pasuje do wybranego typu. Zalecamy ponowne pobranie dokumentu
ru: Документ не соответствует выбранному типу. Рекомендуем повторить загрузку документа
uk: Документ не відповідає вибраному типу. Рекомендуємо повторити завантаження документа

# doc_verif_invalid_pages_count_title
source: Document verification is not successful
pl: Weryfikacja dokumentu nie powiodła się
ru: Верификация документа неуспешна
uk: Верифікація документа неуспішна

# doc_verif_invalid_pages_count_text
source: Incorrect number of loaded images. Reload the document.
pl: Nieprawidłowa liczba przesłanych obrazów. Spróbuj ponownie przesłać dokument
ru: Не корректное количество подгруженных изображений. Повторите загрузку документа
uk: Некоректна кількість завантажених зображень. Повторіть завантаження документа

# doc_verif_invalid_files_title
source: Document verification is not successful
pl: Weryfikacja dokumentu nie powiodła się
ru: Верификация документа неуспешна
uk: Верифікація документа неуспішна

# doc_verif_invalid_files_text
source: The uploaded photos of document are too large or have the wrong file type. Please, try again.
pl: Przesłane zdjęcia dokumentu są zbyt duże lub mają niewłaściwy typ pliku. Proszę spróbuj ponownie.
ru: Загруженные фотографии документа слишком велики или имеют неверный тип файла. Пожалуйста, попробуйте еще раз.
uk: Завантажені фотографії документа завеликі або мають неправильний тип файлу. Будь ласка, спробуйте ще раз.

# doc_verif_primary_already_exists_title
source: Another document has already been uploaded
pl: Inny dokument został już przesłany
ru: Другой документ ранее уже был загружен
uk: Інший документ раніше вже був завантажений

# doc_verif_primary_already_exists_text
source: There is no possibility to upload several documents within one verification. Continue checking the data on the previously uploaded document
pl: W ramach jednej weryfikacji nie ma możliwości wgrania kilku dokumentów. Kontynuuj weryfikację danych względem wcześniej przesłanego dokumentu
ru: В рамках одной верификации отсутствует возможность загружать несколько документов. Продолжите проверку данных по ранее подгруженному документу
uk: В рамках однієї верифікації немає можливості завантажувати кілька документів. Продовжте перевірку даних за раніше завантаженим документом

# doc_verif_upload_attempts_exceeded_title
source: Another document has already been uploaded
pl: Inny dokument został już przesłany
ru: Другой документ ранее уже был загружен
uk: Інший документ раніше вже був завантажений

# doc_verif_upload_attempts_exceeded_text
source: There is no possibility to upload several documents within one verification. Continue checking the data on the previously uploaded document
pl: W ramach jednej weryfikacji nie ma możliwości wgrania kilku dokumentów. Kontynuuj weryfikację danych względem wcześniej przesłanego dokumentu lub zakończ proces weryfikacji na urządzeniu mobilnym
ru: В рамках однй верификации отсутствует возможность загружать несколько документов. Продолжите проверку данных по ранее подгруженному документу
uk: В рамках однієї верифікації немає можливості завантажувати кілька документів. Продовжте перевірку даних за раніше завантаженим документом або завершіть проходження верифікації на мобільному пристрої

# doc_verif_invalid_page_title
source: Document verification is not successful
pl: Weryfikacja dokumentu nie powiodła się
ru: Верификация документа неуспешна
uk: Верифікація документа неуспішна

# doc_verif_invalid_page_text
source: Document compliance check failed. Please, download the correct document
pl: Nie przeszła próba zgodności dokumentów. Proszę, pobierz poprawny dokument
ru: Не пройдена проверка соответствия данных документа. Пожалуйста, загрузите корректный документ
uk: Не пройдено перевірку відповідності даних документа. Завантажте, будь ласка, коректний документ

# doc_verif_fraud_title
source: Photo from screen detected
pl: Zdjęcie z ekranu wykryte
ru: Обнаружено фото с экрана
uk: Виявлено фото з екрана

# doc_verif_fraud_text
source: To pass verification, you must upload a photo of the original document
pl: Aby przejść weryfikację, musisz przesłać zdjęcie oryginalnego dokumentu
ru: Для прохождения верификации необходимо загрузить фото оригинала документа
uk: Щоб пройти перевірку, необхідно завантажити фотографію оригіналу документа

# doc_verif_blur_title
source: Blurred photo
pl: Rozmyte zdjęcie
ru: Неострое фото
uk: Розмите фото

# doc_verif_blur_text
source: Please take a clear picture of the document to continue
pl: Zrób proszę wyraźne zdjęcie dokumentu, aby kontynuować
ru: Пожалуйста, сделайте четкое изображение документа для продолжения
uk: Будь ласка, зробіть чітке зображення документа для продовження

# doc_verif_default_title
source: Document verification is not successful
pl: Weryfikacja dokumentu nie powiodła się
ru: Верификация документа неуспешна
uk: Верифікація документа неуспішна

# doc_verif_default_text
source: For some reason, we were unable to download the content of this page. Try reloading the page.
pl: Z jakiegoś powodu nie mogliśmy załadować zawartości tej strony. Spróbuj ponownie załadować stronę
ru: По какой-то причине мы не смогли загрузить контент данной страницы. Попробуйте перезагрузить страницу
uk: З якоїсь причини ми не змогли завантажити вміст цієї сторінки. Спробуйте перезавантажити сторінку

# doc_verif_print_title
source: Copy detected
pl: Znaleziono kopię
ru: Обнаружена копия
uk: Виявлено копію

# doc_verif_print_text
source: Please upload the original of your document
pl: Prześlij oryginał dokumentu
ru: Пожалуйста, загрузите оригинал Вашего документа
uk: Будь ласка, завантажте оригінал Вашого документу

# in_process_title
source: Please, wait
pl: Proszę czekać
ru: Пожалуйста, подождите
uk: Будь ласка, зачекайте

# in_process_description
source: This may take some time
pl: To może zająć troche czasu.
ru: Это может занять некоторое время.
uk: Це може зайняти деякий час.
