Repository: VCheckOrg/vycheck_ios
Catalog: VCheckSDK/VCheckSDK/*.lproj/VCheckFlow.strings
Languages: pl, ru, uk

# 1c6-jq-Hxi.text
source: Face checking
pl: Porównanie twarzy
ru: Проверка лица
uk: Перевірка обличчя

# 2Ip-f7-uZ5.text
source: There was an issue while uploading a video. Please check your internet connection and try again without moving an app to the background.
pl: Podczas ładowania filmu wystąpił problem. Sprawdź połączenie internetowe i spróbuj ponownie bez przenoszenia aplikacji w tle.
ru: При загрузке видео возникла проблема. Проверьте подключение к Интернету и повторите попытку, не переводя приложение в фоновый режим.
uk: Під час завантаження відео виникла проблема. Перевірте підключення до Інтернету та повторіть спробу, не переміщаючи програму у фоновий режим.

# 2W7-Jm-sUy.text
source: Submitted document must meet the following requirements:
pl: Przesłany dokument musi spełniać następujące wymagania:
ru: Предоставляемый документ должен отвечать следующим требованиям:
uk: Документ, що надається для перевірки, повинен відповідати таким вимогам:

# 3fM-Ho-q55.configuration.title
source: Try again
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати знову

# 3gZ-MQ-puZ.text
source: International passport
pl: Paszport
ru: Загранпаспорт
uk: Закордонний паспорт

# 6v6-eK-T1j.text
source: Upload a photo of a front spread (spread with your photo).
pl: Prześlij zdjęcie strony (strony z Twoim zdjęciem).
ru: Загрузите фото лицевого разворота (разворот с вашим фото).
uk: Завантажте фото лицьового розвороту (розворот із вашим фото).

# 73Y-G0-L4X.text
source: For further processing and validation, select which of the types below corresponds to your document.
pl: W celu dalszego przetwarzania i walidacji proszę wskazać poniżej, który typ odpowiada Twojemu dokumentowi.
ru: Для последующей обработки и валидации укажите, какому из типов ниже соответствует ваш документ.
uk: Для подальшої обробки та валідації вкажіть, який тип нижче відповідає вашому документу.

# 8MH-tb-Ixh.text
source: Something went wrong :(
pl: Coś poszło nie tak :(
ru: Что-то пошло не так :(
uk: Щось пішло не так :(

# 8ou-Zr-Oj3.text
source: Please, wait. The photo of your document is being loaded and processed. This may take from a few seconds to a minute.
pl: Proszę czekać. Zdjęcie Twojego dokumentu jest przesyłane i przetwarzane. Może to trwać od kilku sekund do minuty.
ru: Пожалуйста, подождите. Идет загрузка и обработка фото вашего документа. Это может занять от нескольких секунд до минуты.
uk: Будь ласка, зачекайте. Йде завантаження та обробка фото вашого документа. Це може тривати від кількох секунд до хвилини.

# 939-B9-Kfj.text
source: The time to complete the movement has expired
pl: Czas na wykonanie ruchu upłynął
ru: Время на выполнение движения истекло
uk: Час на виконання руху закінчився

# 9Fe-fP-c8z.configuration.title
source: Copy link
pl: Skopiuj link
ru: Скопировать ссылку
uk: Копіювати посилання

# aNj-4j-beg.text
source: There could be several people in the frame, or foreign objects. When re-checking, try so that only your face is in the frame and you can see it as clearly as possible.
pl: W kadrze może znajdować się kilka osób lub obce przedmioty. Podczas ponownego sprawdzania postaraj się, aby w kadrze znajdowała się tylko twarz i była widoczna jak najwyraźniej.
ru: В кадре могло быть несколько людей, либо посторонние предметы. При повторной проверке постарайтесь, чтобы в кадре было только ваше лицо и его было видно как можно четче.
uk: У кадрі могло бути кілька людей, або сторонні предмети. При повторній перевірці постарайтеся, щоб у кадрі було тільки ваше обличчя і його було видно якомога чіткіше.

# ato-ly-woq.text
source: First, place your face in the center of the frame, then perform the requested movements.
pl: Najpierw umieść twarz na środku kadru, a następnie przesuń głowę w określonym kierunku, jak w poniższym przykładzie, aby pokazać twarz ze wszystkich kątów.
ru: Сначала разместите лицо по центру кадра, затем двигайте головой в заданном направлении, как на примере ниже, чтобы показать свое лицо со всех углов.
uk: Спочатку розмістіть обличчя по центру кадру, потім рухайте головою в заданому напрямку, як на прикладі нижче, щоб показати своє обличчя з усіх кутів.

# ATp-gm-vMv.text
source: fixed camera (try not to move the camera)
pl: kamera jest nieruchoma (staraj się nie ruszać kamerą)
ru: зафиксированная камера (старайтесь не двигать камерой)
uk: зафіксована камера (намагайтеся не рухати камерою)

# Bn8-gv-ckR.text
source: We didn't find a page with that address :(
pl: Nie znaleźliśmy strony o tym adresie:(
ru: Мы не нашли страницы с таким адресом :(
uk: Ми не знайшли сторінки з такою адресою:(

# bPH-Ay-ydn.text
source: Internal passport
pl: Paszport obywatela
ru: Внутренний паспорт гражданина
uk: Внутрішній паспорт громадянина

# bVd-GC-ULM.text
source: The motion that was requested was not executed correctly. Try to do exactly those movements that are requested. Movements should be fluid and timely.
pl: Ruch, który należało wykonać, nie został wykonany prawidłowo. Postaraj się wykonać dokładnie te ruchy, o które Cię proszą. Ruchy powinny być płynne i terminowe.
ru: Движение, которое запрашивалось не было выполнено корректно. Старайтесь делать именно те движения, которые запрашиваются. Движения должны быть плавными и своевременными.
uk: Рух, який потрібно було виконати не був виконаний коректно. Намагайтеся робити саме ті рухи, які запитують. Рухи мають бути плавними та своєчасними.

# Ci0-dm-ifp.text
source: Non available
pl: Niedostępny
ru: Недоступно
uk: Недоступний

# cY3-cf-m9e.text
source: Ukraine
pl: Ukraina
ru: Украина
uk: Україна

# DdH-Xd-pgi.configuration.title
source: Local Liveness Demo
pl: Liveness(Lokalnie!)
ru: Liveness(Локально!)
uk: Liveness(Локально!)

# Dtj-8M-eb8.text
source: Verification successful
pl: Weryfikacja przebiegła pomyślnie
ru: Верификация успешна
uk: Верифікація успішна

# EaO-z6-vaI.configuration.title
source: I am confident in my document, continue the verification process
pl: Jestem pewny mojego dokumentu, kontynuuj proces weryfikacji
ru: Я уверен(-а) в своем документе, продолжить процесс верификации
uk: Я впевнений(-а) в своєму документі, продовжити процес верифікації

# eta-Xk-i4x.text
source: Try to move smoothly. Please, try again.
pl: Staraj się wykonywać ruchy płynnie. Spróbuj ponownie.
ru: Старайтесь выполнять движения плавно. Попробуйте снова.
uk: Намагайтеся виконувати рухи плавно. Спробуйте знову.

# EY3-6C-cJ9.text
source: no foreign objects: covers, fingers, paper clips, etc.
pl: nie ma żadnych obcych przedmiotów: okładek, palców, spinaczy itp.
ru: нет посторонних объектов: обложки, пальцев, скрепок и т.п.
uk: немає сторонніх об'єктів: обкладинки, пальців, скріпок тощо.

# f3n-0Y-qsf.text
source: Loading...
pl: Czekaj...
ru: Загрузка...
uk: Зачекайте...

# fFZ-MA-crE.text
source: Select the country
pl: Wybierz kraj
ru: Выберите страну
uk: Оберіть країну

# FNT-ys-lqv.text
source: Reconciliation / filling of data
pl: Weryfikacja / uzupełnianie danych
ru: Сверка заполнения данных
uk: Перевірка / заповнення даних

# fRM-vS-6wd.text
source: Take a picture
pl: Zrobić zdjęcie
ru: Сделать фото
uk: Зробити фото

# fVU-YR-D7u.placeholder
source: Search
pl: Szukaj
ru: Поиск
uk: Пошук

# GCm-VK-XhF.text
source: Take a photo of the document
pl: Zrób zdjęcie dokumentu
ru: Сделайте фото документа
uk: Зробіть фото документа

# gCO-14-vPo.configuration.title
source: Try again
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати знову

# gGK-zu-Dsf.text
source: Take a picture
pl: Zrobić zdjęcie
ru: Сделать фото
uk: Зробити фото

# goj-ZF-231.text
source: Check your photo
pl: Sprawdź swoje zdjęcie
ru: Проверьте свое фото
uk: Перевірте своє фото

# ACV-UJ-hZv.text
source: original (not a photocopy, not a photo)
pl: oryginał (nie kserokopia, nie zdjęcie)
ru: оригинал (не ксерокопия, не фото)
uk: оригінал (не ксерокопія, не фото)

# hgH-RH-Doo.text
source: Document requirements
pl: Wymagania dotyczące dokumentów
ru: Требования к документу
uk: Вимоги до документа

# hJ9-Ol-hHi.text
source: While all application data sent to our services is being processed, you may return to the partner service.
pl: Wszystkie niezbędne dane do aplikacji o weryfikację zostały przesłane do naszych służb i są w końcowej fazie przetwarzania. Możesz wrócić do serwisu partnerskiego.
ru: Все необходимые данные по заявке на верификацию отправлены на наши сервисы и находятся на финальной стадии обработки. Вы можете вернуться к партнерскому сервису.
uk: Усі необхідні дані по заявці на верифікацію надіслані на наші сервіси та знаходяться на фінальній стадії обробки. Ви можете повернутись до партнерського сервісу.

# iad-2I-iin.text
source: Your application is sent for final verification stage.
pl: Twoja aplikacja została przesłana do ostatniego etapu weryfikacji.
ru: Ваша заявка отправлена на финальную стадию верификации.
uk: Ваша заявка відправлена на фінальну стадію верифікації.

# IDl-aE-NPd.text
source: Movements are too fast
pl: Zbyt szybkie ruchy
ru: Слишком резкие движения
uk: Занадто різкі рухи

# ilv-19-slf.text
source: movements should be clear and smooth
pl: ruchy powinny być wyraźne i płynne
ru: движения должны быть четкими и плавными
uk: рухи повинні бути чіткими та плавними

# iqs-Cd-Nh9.text
source: Face check cannot be performed because it's too dark. Try again with good lighting.
pl: Nie można przeprowadzić sprawdzenia, ponieważ ramka jest zbyt ciemna. Powtórz ponownie z dobrym oświetleniem.
ru: Проверка не может выполниться, так как в кадре слишком темно. Пройдите проверку повторно с хорошим освещением.
uk: Перевірка не може виконатись, тому що в кадрі занадто темно. Повторіть знову з хорошим освітленням.

# J06-xe-Wnh.configuration.title
source: Retry
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати ще

# jks-Ld-fXF.configuration.title
source: Try again
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати знову

# k0x-f9-qUL.text
source: Upload a reverse page photo.
pl: Dopuszczalny format obrazu: JPG, JPEG
ru: Загрузите фото обратного разворота.
uk: Допустимий формат зображення: JPG, JPEG

# k3O-6X-MdF.text
source: valid at the time of dispatch
pl: ważne w momencie wysyłki
ru: действителен на момент отправки
uk: дійсний на момент відправлення

# KCf-7P-AoR.configuration.title
source: Back
pl: Zwrócić
ru: Вернуться
uk: Повернутися

# Kfa-tK-cWU.configuration.title
source: Excellent!
pl: Doskonale
ru: Отлично
uk: Чудово

# kMc-Ag-ZwR.text
source: The camera was not found or you have denied access to it. If the camera works correctly, give access to it and try again. If the problem persists, try to copy the verification link and continue on a different device.
pl: Nie znaleziono kamery lub odmówiono dostępu do niej. Jeśli kamera działa poprawnie - kliknij przycisk poniżej i w oknie daj dostęp do jej obsługi. Jeśli problem będzie się powtarzał, spróbuj skopiować link weryfikacyjny, aby kontynuować na innym urządzeniu
ru: Камера не найдена, либо вы отказали в доступе к ней. Если камера работает исправно - нажмите на кнопку ниже и в появившемся окне дайте доступ на ее использование. Если проблема не решилась попробуйте скопировать ссылку на верефикацию продолжить на другом устройстве
uk: Камера не знайдена або ви відмовили у доступі до неї. Якщо камера працює справно - натисніть кнопку нижче і у вікні дайте доступ на її використання. Якщо проблема не вирішилася, спробуйте скопіювати посилання на верефікацію продовжити на іншому пристрої

# LeA-wx-gAE.configuration.title
source: Try again
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати знову

# lqU-VZ-pLL.text
source: all protective elements are visible
pl: wszystkie elementy ochronne są widoczne
ru: видны все защитные элементы
uk: видно всі захисні елементи

# lZr-qg-h72.text
source: the image must be in color
pl: obraz musi być w kolorze
ru: изображение должно быть цветным
uk: зображення має бути кольоровим

# mhV-l1-ZoU.text
source: Something went wrong. We recommend to re-upload the document.
pl: Coś poszło nie tak. Zalecamy ponowne pobranie dokumentu.
ru: Что-то пошло не так. Мы рекомендуем сфотографировать документ еще раз.
uk: Щось пішло не так. Рекомендуємо повторити завантаження документа.

# NhH-7f-gBD.text
source: Too dark
pl: Jest za ciemno
ru: Слишком темно
uk: Занадто темно

# o5B-Kh-Vep.text
source: Biometric passport (ID card)
pl: Dowód osobisty
ru: Биометрический паспорт (ID-карта)
uk: Біометричний паспорт (ID-картка)

# O84-jd-0oF.text
source: Country
pl: Kraj
ru: Страна
uk: Країна

# oMH-sQ-S0l.configuration.title
source: That's allright! Continue
pl: Wszystko się zgadza! Kontynuować
ru: Все верно! Продолжить
uk: Все вірно! Продовжити

# oMH-sQ-S0l.normalTitle
source: That's allright! Continue
pl: Wszystko się zgadza! Kontynuować
ru: Все верно! Продолжить
uk: Все вірно! Продовжити

# Oov-Zo-rlv.text
source: This may take some time. Meanwhile, you can return to the main service.
pl: To może zająć troche czasu. Możesz teraz wrócić do głównego serwisu.
ru: Это может занять некоторое время. Теперь вы можете вернуться к основному сервису.
uk: Це може зайняти деякий час. Тепер ви можете повернутись до основного сервісу.

# OPz-op-RyB.text
source: You didn't look straight
pl: Nie patrzyłeś prosto
ru: Вы не смотрели прямо
uk: Ви не дивилися прямо

# pmI-2b-PrY.configuration.title
source: Close
pl: Zamknąć
ru: Закрыть
uk: Закрити

# PPj-wU-k0I.text
source: Camera not available
pl: Aparat jest niedostępny
ru: Камера не доступна
uk: Камера не доступна

# QOe-mg-i3J.text
source: perform only requested movements
pl: wykonuj tylko żądane ruchy
ru: выполняйте только запрашиваемые движения
uk: виконуйте тільки рухи, що запитуються

# QxK-2h-Je3.configuration.title
source: Try again
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати знову

# r7D-Nn-4Ql.configuration.title
source: All clear. Start verification
pl: Rozpocznij weryfikację
ru: Начать проверку
uk: Розпочати перевірку

# rBN-xJ-7O7.configuration.title
source: Contact support
pl: Skontaktuj się z działem pomocy technicznej
ru: Обратиться в службу поддержки
uk: Звернутися в службу підтримки

# Rsg-z4-gbq.configuration.title
source: Retry
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати ще

# S8c-XH-tNZ.text
source: find a place with good lighting (bright, but no bright lights)
pl: znajdź miejsce z dobrym oświetleniem (światło, ale bez jasnych świateł)
ru: найдите место с хорошим освещением (светло, но без ярких засветов)
uk: знайдіть місце з хорошим освітленням (світло, але без яскравих засвітів)

# sAt-oD-4Mb.text
source: there should be no interference in the frame
pl: w kadrze nie powinno być żadnych przeszkód
ru: в кадре не должно быть помех
uk: у кадрі не повинно бути перешкод

# SQC-lw-w5d.text
source: The face was not captured right in the frame at the right moment for this. Try to strictly adhere to the instructions at the time of the verification. Try again.
pl: Twarz nie została uchwycona bezpośrednio w kadrze w odpowiednim momencie. Staraj się ściśle przestrzegać instrukcji w czasie kontroli. Spróbuj ponownie.
ru: Лицо не было зафиксировано прямо в кадре в необходимый для этого момент. Старайтесь четко придерживаться инструкций в момент прохождения проверки. Попробуйте снова.
uk: Обличчя не було зафіксовано прямо в кадрі у необхідний для цього момент. Намагайтеся чітко дотримуватись інструкцій у момент проходження перевірки. Спробуйте знову.

# t8n-y7-cdZ.configuration.title
source: Confirm
pl: Potwierdzić
ru: Подтвердить
uk: Підтвердити

# TdZ-WF-NIV.text
source: There are a lot of obstacles in the frame
pl: W kadrze jest wiele przeszkód
ru: В кадре много помех
uk: У кадрі багато перешкод

# tZV-5H-szz.text
source: Country
pl: Kraj
ru: Страна
uk: Країна

# U6K-vN-zaz.text
source: Country
pl: Kraj
ru: Страна
uk: Країна

# UJr-ZK-4ZA.text
source: Operating system not supported
pl: System operacyjny nie jest obsługiwany
ru: Операционная система не поддерживаеться
uk: Операційна система не підтримується

# uLu-gA-21w.text
source: You did not have time to complete the correct movement. Try to strictly adhere to the instructions at the time of the verification. Try again.
pl: Nie miałeś czasu na wykonanie prawidłowego ruchu. Staraj się ściśle przestrzegać instrukcji w czasie kontroli
ru: Вы не успели выполнить корректное движение. Старайтесь четко придерживаться инструкций в момент прохождения проверки
uk: Ви не встигли зробити коректний рух. Намагайтеся чітко дотримуватись інструкцій у момент проходження перевірки

# uol-az-Qka.text
source: Wrong movement
pl: Nieprawidłowy ruch
ru: Неверное движение
uk: Неправильний рух

# uXu-nD-622.configuration.title
source: Start Demo Flow
pl: Wypróbuj demo
ru: Попробовать демо
uk: Спробувати демо

# v87-W5-vbC.configuration.title
source: Try again
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати знову

# vIo-1V-hp0.text
source: Document verification is not successful
pl: Weryfikacja dokumentu nie powiodła się
ru: Верификация документа неуспешна
uk: Верифікація документа неуспішна

# Vpj-sc-FAg.configuration.title
source: To home
pl: Do strony głównej
ru: На главную
uk: На головну

# VQx-HL-SS1.text
source: Check the readability of the information in the photo. Make sure all 4 corners of the document are visible in the photo
pl: Sprawdź czytelność informacji na zdjęciu. Upewnij się, że wszystkie 4 rogi dokumentu są widoczne na zdjęciu.
ru: Проверьте читаемость информации на фото. Убедитесь, что на фото видны все 4 угла документа
uk: Перевірте читабельність інформації на фото. Переконайтеся, що на фото видно всі 4 кути документа.

# vUd-yM-LbS.text
source: all 4 corners of the document are fully visible
pl: wszystkie 4 rogi dokumentu są w pełni widoczne
ru: полностью видны все 4 угла документа
uk: повністю видно всі 4 кути документа

# w2I-Vr-HHn.text
source: Unfortunately, this mobile OS is not supported. To successfully complete the verification procedure, we recommend that you copy the link below and continue on your personal computer
pl: Niestety ten mobilny system operacyjny nie jest obsługiwany. Aby pomyślnie przejść procedurę weryfikacji, zalecamy skopiowanie poniższego linku i kontynuowanie na komputerze osobistym
ru: К сожалению, данная мобильная ОС не поддерживается. Для успешного прохождения процедуры верификации рекомендуем вам скопировать ссылку ниже и продолжить на персональном компьютере
uk: На жаль, ця мобільна ОС не підтримується. Для успішного проходження процедури верифікації рекомендуємо вам скопіювати посилання нижче та продовжити на персональному комп'ютері

# W64-Ne-sgD.configuration.title
source: Continue
pl: Kontynuować
ru: Продолжить
uk: Продовжити

# Wgk-ad-nWW.text
source: Check if all the data on the document was recognized correctly.
pl: Sprawdź, czy wszystkie dane dokumentu zostały poprawnie rozpoznane?
ru: Проверьте, все ли данные по документу были распознаны корректно?
uk: Перевірте, чи всі дані документа були розпізнані коректно?

# wgy-0K-AbA.text
source: Change photo
pl: Zastąp zdjęcie
ru: Заменить фото
uk: Замінити фото

# wM8-4G-pEK.configuration.title
source: Cancel
pl: Anulowanie
ru: Отмена
uk: Відміна

# WXG-eJ-qvn.configuration.title
source: Retry
pl: Spróbuj ponownie
ru: Попробовать снова
uk: Спробувати ще

# XJJ-7D-hfl.text
source: Select document type
pl: Wybierz typ dokumentu
ru: Выберите тип документа
uk: Оберіть тип документа

# YYe-al-bEj.configuration.title
source: Continue
pl: Kontynuować
ru: Продолжить
uk: Продовжити

# ZKB-FU-zba.configuration.title
source: Give access to the camera
pl: Zezwól na dostęp do aparatu
ru: Дать доступ к камере
uk: Дати доступ до камери

# zMS-X5-1mQ.text
source: Select the country of registration of your document, which should be uploaded in the next step.
pl: Wybierz kraj rejestracji dokumentu, który będzie musiał zostać sfotografowany w następnym kroku.
ru: Выберите страну регистрации вашего документа, который необходимо будет сфотографировать на следующем шаге.
uk: Оберіть країну реєстрації вашого документа, який потрібно буде сфотографувати на наступному кроці.

# ZNG-ph-Cor.configuration.title
source: Continue
pl: Kontynuować
ru: Продолжить
uk: Продовжити

# IUM-aR-pey.text
source: No data available
pl: Brak dostępnych danych
uk: Немає даних

# 6yr-kz-O3F.configuration.title
source: Great
pl: Doskonale
ru: Отлично
uk: Чудово
